<?xml version="1.0" encoding="UTF-8"?>
<policyDefinitions revision="1.0.5.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="IPM" namespace="Intune-Printer-Mapping.Configuration"/>
  </policyNamespaces>
  <supersededAdm fileName=""/>
  <resources minRequiredRevision="1.0"/>
  <supportedOn>
    <definitions>
      <definition name="SupportedOn" displayName="$(string.SupportedOn)"/>
    </definitions>
  </supportedOn>
  <categories>
    <category name="IntunePrinterMapping" displayName="$(string.IntunePrinterMapping)"/>
    <category name="Configuration" displayName="$(string.Configuration)">
      <parentCategory ref="IntunePrinterMapping"/>
    </category>
    <category name="Printers" displayName="$(string.Printers)">
      <parentCategory ref="IntunePrinterMapping"/>
    </category>
  </categories>
  <policies>
    <policy name="Enabled" class="Machine" displayName="$(string.Enabled)" explainText="$(string.Enabled_Help)" key="Software\Policies\weatherlights.com\NetworkPrintMapping" valueName="Enabled">
      <parentCategory ref="Configuration"/>
      <supportedOn ref="SupportedOn"/>
      <enabledValue>
        <decimal value="1"/>
      </enabledValue>
      <disabledValue>
        <decimal value="0"/>
      </disabledValue>
    </policy>
    <policy name="RefreshInterval" class="Machine" displayName="$(string.RefreshInterval)" presentation="$(presentation.RefreshInterval)" explainText="$(string.RefreshInterval_Help)" key="Software\Policies\weatherlights.com\NetworkPrintMapping" valueName="RefreshInterval">
      <parentCategory ref="Configuration"/>
      <supportedOn ref="SupportedOn"/>
      <elements>
        <decimal id="RefreshInterval" key="Software\Policies\weatherlights.com\NetworkPrintMapping" valueName="RefreshInterval" required="true" minValue="1" maxValue="100000"/>
      </elements>
    </policy>
    <policy name="UpdateInterval" class="Machine" displayName="$(string.UpdateInterval)" presentation="$(presentation.UpdateInterval)" explainText="$(string.UpdateInterval_Help)" key="Software\Policies\weatherlights.com\NetworkPrintMapping" valueName="UpdateInterval">
      <parentCategory ref="Configuration"/>
      <supportedOn ref="SupportedOn"/>
      <elements>
        <decimal id="UpdateInterval" key="Software\Policies\weatherlights.com\NetworkPrintMapping" valueName="UpdateInterval" required="true" minValue="0" maxValue="100000"/>
      </elements>
    </policy>
    <policy name="PrinterConfigurationRefreshInterval" class="Machine" displayName="$(string.PrinterConfigurationRefreshInterval)" presentation="$(presentation.PrinterConfigurationRefreshInterval)" explainText="$(string.PrinterConfigurationRefreshInterval_Help)" key="Software\Policies\weatherlights.com\NetworkPrintMapping" valueName="PrinterConfigurationRefreshInterval">
      <parentCategory ref="Configuration"/>
      <supportedOn ref="SupportedOn"/>
      <elements>
        <decimal id="PrinterConfigurationRefreshInterval" key="Software\Policies\weatherlights.com\NetworkPrintMapping" valueName="PrinterConfigurationRefreshInterval" required="true" minValue="0" maxValue="100000"/>
      </elements>
    </policy>
    
<policy name="Printer_0_User" class="User" displayName="$(string.Printer_0_User_DisplayName)" explainText="$(string.Printer_0_User_ExplainText)" presentation="$(presentation.Printer_0_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="0">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_0_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\0" valueName="Path" required="true" />
        <enum id="Printer_0_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\0" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_0_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\0" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_1_User" class="User" displayName="$(string.Printer_1_User_DisplayName)" explainText="$(string.Printer_1_User_ExplainText)" presentation="$(presentation.Printer_1_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="1">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_1_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\1" valueName="Path" required="true" />
        <enum id="Printer_1_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\1" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_1_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\1" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_2_User" class="User" displayName="$(string.Printer_2_User_DisplayName)" explainText="$(string.Printer_2_User_ExplainText)" presentation="$(presentation.Printer_2_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="2">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_2_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\2" valueName="Path" required="true" />
        <enum id="Printer_2_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\2" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_2_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\2" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_3_User" class="User" displayName="$(string.Printer_3_User_DisplayName)" explainText="$(string.Printer_3_User_ExplainText)" presentation="$(presentation.Printer_3_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="3">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_3_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\3" valueName="Path" required="true" />
        <enum id="Printer_3_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\3" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_3_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\3" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_4_User" class="User" displayName="$(string.Printer_4_User_DisplayName)" explainText="$(string.Printer_4_User_ExplainText)" presentation="$(presentation.Printer_4_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="4">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_4_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\4" valueName="Path" required="true" />
        <enum id="Printer_4_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\4" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_4_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\4" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_5_User" class="User" displayName="$(string.Printer_5_User_DisplayName)" explainText="$(string.Printer_5_User_ExplainText)" presentation="$(presentation.Printer_5_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="5">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_5_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\5" valueName="Path" required="true" />
        <enum id="Printer_5_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\5" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_5_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\5" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_6_User" class="User" displayName="$(string.Printer_6_User_DisplayName)" explainText="$(string.Printer_6_User_ExplainText)" presentation="$(presentation.Printer_6_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="6">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_6_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\6" valueName="Path" required="true" />
        <enum id="Printer_6_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\6" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_6_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\6" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_7_User" class="User" displayName="$(string.Printer_7_User_DisplayName)" explainText="$(string.Printer_7_User_ExplainText)" presentation="$(presentation.Printer_7_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="7">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_7_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\7" valueName="Path" required="true" />
        <enum id="Printer_7_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\7" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_7_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\7" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_8_User" class="User" displayName="$(string.Printer_8_User_DisplayName)" explainText="$(string.Printer_8_User_ExplainText)" presentation="$(presentation.Printer_8_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="8">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_8_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\8" valueName="Path" required="true" />
        <enum id="Printer_8_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\8" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_8_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\8" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_9_User" class="User" displayName="$(string.Printer_9_User_DisplayName)" explainText="$(string.Printer_9_User_ExplainText)" presentation="$(presentation.Printer_9_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="9">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_9_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\9" valueName="Path" required="true" />
        <enum id="Printer_9_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\9" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_9_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\9" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_10_User" class="User" displayName="$(string.Printer_10_User_DisplayName)" explainText="$(string.Printer_10_User_ExplainText)" presentation="$(presentation.Printer_10_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="10">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_10_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\10" valueName="Path" required="true" />
        <enum id="Printer_10_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\10" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_10_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\10" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_11_User" class="User" displayName="$(string.Printer_11_User_DisplayName)" explainText="$(string.Printer_11_User_ExplainText)" presentation="$(presentation.Printer_11_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="11">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_11_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\11" valueName="Path" required="true" />
        <enum id="Printer_11_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\11" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_11_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\11" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_12_User" class="User" displayName="$(string.Printer_12_User_DisplayName)" explainText="$(string.Printer_12_User_ExplainText)" presentation="$(presentation.Printer_12_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="12">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_12_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\12" valueName="Path" required="true" />
        <enum id="Printer_12_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\12" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_12_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\12" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_13_User" class="User" displayName="$(string.Printer_13_User_DisplayName)" explainText="$(string.Printer_13_User_ExplainText)" presentation="$(presentation.Printer_13_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="13">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_13_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\13" valueName="Path" required="true" />
        <enum id="Printer_13_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\13" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_13_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\13" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_14_User" class="User" displayName="$(string.Printer_14_User_DisplayName)" explainText="$(string.Printer_14_User_ExplainText)" presentation="$(presentation.Printer_14_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="14">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_14_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\14" valueName="Path" required="true" />
        <enum id="Printer_14_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\14" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_14_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\14" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_15_User" class="User" displayName="$(string.Printer_15_User_DisplayName)" explainText="$(string.Printer_15_User_ExplainText)" presentation="$(presentation.Printer_15_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="15">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_15_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\15" valueName="Path" required="true" />
        <enum id="Printer_15_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\15" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_15_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\15" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_16_User" class="User" displayName="$(string.Printer_16_User_DisplayName)" explainText="$(string.Printer_16_User_ExplainText)" presentation="$(presentation.Printer_16_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="16">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_16_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\16" valueName="Path" required="true" />
        <enum id="Printer_16_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\16" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_16_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\16" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_17_User" class="User" displayName="$(string.Printer_17_User_DisplayName)" explainText="$(string.Printer_17_User_ExplainText)" presentation="$(presentation.Printer_17_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="17">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_17_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\17" valueName="Path" required="true" />
        <enum id="Printer_17_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\17" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_17_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\17" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_18_User" class="User" displayName="$(string.Printer_18_User_DisplayName)" explainText="$(string.Printer_18_User_ExplainText)" presentation="$(presentation.Printer_18_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="18">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_18_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\18" valueName="Path" required="true" />
        <enum id="Printer_18_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\18" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_18_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\18" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_19_User" class="User" displayName="$(string.Printer_19_User_DisplayName)" explainText="$(string.Printer_19_User_ExplainText)" presentation="$(presentation.Printer_19_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="19">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_19_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\19" valueName="Path" required="true" />
        <enum id="Printer_19_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\19" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_19_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\19" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_20_User" class="User" displayName="$(string.Printer_20_User_DisplayName)" explainText="$(string.Printer_20_User_ExplainText)" presentation="$(presentation.Printer_20_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="20">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_20_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\20" valueName="Path" required="true" />
        <enum id="Printer_20_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\20" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_20_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\20" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_21_User" class="User" displayName="$(string.Printer_21_User_DisplayName)" explainText="$(string.Printer_21_User_ExplainText)" presentation="$(presentation.Printer_21_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="21">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_21_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\21" valueName="Path" required="true" />
        <enum id="Printer_21_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\21" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_21_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\21" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_22_User" class="User" displayName="$(string.Printer_22_User_DisplayName)" explainText="$(string.Printer_22_User_ExplainText)" presentation="$(presentation.Printer_22_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="22">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_22_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\22" valueName="Path" required="true" />
        <enum id="Printer_22_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\22" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_22_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\22" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_23_User" class="User" displayName="$(string.Printer_23_User_DisplayName)" explainText="$(string.Printer_23_User_ExplainText)" presentation="$(presentation.Printer_23_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="23">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_23_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\23" valueName="Path" required="true" />
        <enum id="Printer_23_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\23" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_23_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\23" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_24_User" class="User" displayName="$(string.Printer_24_User_DisplayName)" explainText="$(string.Printer_24_User_ExplainText)" presentation="$(presentation.Printer_24_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="24">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_24_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\24" valueName="Path" required="true" />
        <enum id="Printer_24_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\24" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_24_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\24" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_25_User" class="User" displayName="$(string.Printer_25_User_DisplayName)" explainText="$(string.Printer_25_User_ExplainText)" presentation="$(presentation.Printer_25_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="25">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_25_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\25" valueName="Path" required="true" />
        <enum id="Printer_25_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\25" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_25_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\25" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_26_User" class="User" displayName="$(string.Printer_26_User_DisplayName)" explainText="$(string.Printer_26_User_ExplainText)" presentation="$(presentation.Printer_26_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="26">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_26_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\26" valueName="Path" required="true" />
        <enum id="Printer_26_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\26" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_26_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\26" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_27_User" class="User" displayName="$(string.Printer_27_User_DisplayName)" explainText="$(string.Printer_27_User_ExplainText)" presentation="$(presentation.Printer_27_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="27">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_27_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\27" valueName="Path" required="true" />
        <enum id="Printer_27_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\27" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_27_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\27" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_28_User" class="User" displayName="$(string.Printer_28_User_DisplayName)" explainText="$(string.Printer_28_User_ExplainText)" presentation="$(presentation.Printer_28_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="28">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_28_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\28" valueName="Path" required="true" />
        <enum id="Printer_28_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\28" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_28_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\28" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_29_User" class="User" displayName="$(string.Printer_29_User_DisplayName)" explainText="$(string.Printer_29_User_ExplainText)" presentation="$(presentation.Printer_29_User_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="29">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_29_User_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\29" valueName="Path" required="true" />
        <enum id="Printer_29_User_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\29" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_29_User_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\29" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_0_Machine" class="Machine" displayName="$(string.Printer_0_Machine_DisplayName)" explainText="$(string.Printer_0_Machine_ExplainText)" presentation="$(presentation.Printer_0_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="0">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_0_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\0" valueName="Path" required="true" />
        <enum id="Printer_0_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\0" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_0_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\0" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_1_Machine" class="Machine" displayName="$(string.Printer_1_Machine_DisplayName)" explainText="$(string.Printer_1_Machine_ExplainText)" presentation="$(presentation.Printer_1_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="1">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_1_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\1" valueName="Path" required="true" />
        <enum id="Printer_1_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\1" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_1_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\1" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_2_Machine" class="Machine" displayName="$(string.Printer_2_Machine_DisplayName)" explainText="$(string.Printer_2_Machine_ExplainText)" presentation="$(presentation.Printer_2_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="2">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_2_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\2" valueName="Path" required="true" />
        <enum id="Printer_2_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\2" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_2_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\2" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_3_Machine" class="Machine" displayName="$(string.Printer_3_Machine_DisplayName)" explainText="$(string.Printer_3_Machine_ExplainText)" presentation="$(presentation.Printer_3_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="3">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_3_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\3" valueName="Path" required="true" />
        <enum id="Printer_3_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\3" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_3_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\3" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_4_Machine" class="Machine" displayName="$(string.Printer_4_Machine_DisplayName)" explainText="$(string.Printer_4_Machine_ExplainText)" presentation="$(presentation.Printer_4_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="4">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_4_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\4" valueName="Path" required="true" />
        <enum id="Printer_4_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\4" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_4_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\4" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_5_Machine" class="Machine" displayName="$(string.Printer_5_Machine_DisplayName)" explainText="$(string.Printer_5_Machine_ExplainText)" presentation="$(presentation.Printer_5_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="5">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_5_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\5" valueName="Path" required="true" />
        <enum id="Printer_5_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\5" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_5_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\5" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_6_Machine" class="Machine" displayName="$(string.Printer_6_Machine_DisplayName)" explainText="$(string.Printer_6_Machine_ExplainText)" presentation="$(presentation.Printer_6_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="6">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_6_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\6" valueName="Path" required="true" />
        <enum id="Printer_6_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\6" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_6_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\6" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_7_Machine" class="Machine" displayName="$(string.Printer_7_Machine_DisplayName)" explainText="$(string.Printer_7_Machine_ExplainText)" presentation="$(presentation.Printer_7_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="7">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_7_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\7" valueName="Path" required="true" />
        <enum id="Printer_7_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\7" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_7_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\7" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_8_Machine" class="Machine" displayName="$(string.Printer_8_Machine_DisplayName)" explainText="$(string.Printer_8_Machine_ExplainText)" presentation="$(presentation.Printer_8_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="8">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_8_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\8" valueName="Path" required="true" />
        <enum id="Printer_8_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\8" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_8_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\8" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_9_Machine" class="Machine" displayName="$(string.Printer_9_Machine_DisplayName)" explainText="$(string.Printer_9_Machine_ExplainText)" presentation="$(presentation.Printer_9_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="9">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_9_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\9" valueName="Path" required="true" />
        <enum id="Printer_9_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\9" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_9_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\9" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_10_Machine" class="Machine" displayName="$(string.Printer_10_Machine_DisplayName)" explainText="$(string.Printer_10_Machine_ExplainText)" presentation="$(presentation.Printer_10_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="10">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_10_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\10" valueName="Path" required="true" />
        <enum id="Printer_10_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\10" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_10_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\10" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_11_Machine" class="Machine" displayName="$(string.Printer_11_Machine_DisplayName)" explainText="$(string.Printer_11_Machine_ExplainText)" presentation="$(presentation.Printer_11_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="11">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_11_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\11" valueName="Path" required="true" />
        <enum id="Printer_11_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\11" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_11_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\11" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_12_Machine" class="Machine" displayName="$(string.Printer_12_Machine_DisplayName)" explainText="$(string.Printer_12_Machine_ExplainText)" presentation="$(presentation.Printer_12_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="12">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_12_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\12" valueName="Path" required="true" />
        <enum id="Printer_12_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\12" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_12_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\12" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_13_Machine" class="Machine" displayName="$(string.Printer_13_Machine_DisplayName)" explainText="$(string.Printer_13_Machine_ExplainText)" presentation="$(presentation.Printer_13_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="13">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_13_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\13" valueName="Path" required="true" />
        <enum id="Printer_13_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\13" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_13_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\13" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_14_Machine" class="Machine" displayName="$(string.Printer_14_Machine_DisplayName)" explainText="$(string.Printer_14_Machine_ExplainText)" presentation="$(presentation.Printer_14_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="14">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_14_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\14" valueName="Path" required="true" />
        <enum id="Printer_14_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\14" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_14_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\14" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_15_Machine" class="Machine" displayName="$(string.Printer_15_Machine_DisplayName)" explainText="$(string.Printer_15_Machine_ExplainText)" presentation="$(presentation.Printer_15_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="15">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_15_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\15" valueName="Path" required="true" />
        <enum id="Printer_15_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\15" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_15_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\15" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_16_Machine" class="Machine" displayName="$(string.Printer_16_Machine_DisplayName)" explainText="$(string.Printer_16_Machine_ExplainText)" presentation="$(presentation.Printer_16_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="16">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_16_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\16" valueName="Path" required="true" />
        <enum id="Printer_16_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\16" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_16_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\16" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_17_Machine" class="Machine" displayName="$(string.Printer_17_Machine_DisplayName)" explainText="$(string.Printer_17_Machine_ExplainText)" presentation="$(presentation.Printer_17_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="17">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_17_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\17" valueName="Path" required="true" />
        <enum id="Printer_17_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\17" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_17_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\17" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_18_Machine" class="Machine" displayName="$(string.Printer_18_Machine_DisplayName)" explainText="$(string.Printer_18_Machine_ExplainText)" presentation="$(presentation.Printer_18_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="18">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_18_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\18" valueName="Path" required="true" />
        <enum id="Printer_18_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\18" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_18_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\18" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_19_Machine" class="Machine" displayName="$(string.Printer_19_Machine_DisplayName)" explainText="$(string.Printer_19_Machine_ExplainText)" presentation="$(presentation.Printer_19_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="19">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_19_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\19" valueName="Path" required="true" />
        <enum id="Printer_19_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\19" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_19_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\19" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_20_Machine" class="Machine" displayName="$(string.Printer_20_Machine_DisplayName)" explainText="$(string.Printer_20_Machine_ExplainText)" presentation="$(presentation.Printer_20_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="20">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_20_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\20" valueName="Path" required="true" />
        <enum id="Printer_20_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\20" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_20_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\20" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_21_Machine" class="Machine" displayName="$(string.Printer_21_Machine_DisplayName)" explainText="$(string.Printer_21_Machine_ExplainText)" presentation="$(presentation.Printer_21_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="21">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_21_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\21" valueName="Path" required="true" />
        <enum id="Printer_21_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\21" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_21_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\21" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_22_Machine" class="Machine" displayName="$(string.Printer_22_Machine_DisplayName)" explainText="$(string.Printer_22_Machine_ExplainText)" presentation="$(presentation.Printer_22_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="22">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_22_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\22" valueName="Path" required="true" />
        <enum id="Printer_22_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\22" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_22_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\22" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_23_Machine" class="Machine" displayName="$(string.Printer_23_Machine_DisplayName)" explainText="$(string.Printer_23_Machine_ExplainText)" presentation="$(presentation.Printer_23_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="23">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_23_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\23" valueName="Path" required="true" />
        <enum id="Printer_23_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\23" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_23_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\23" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_24_Machine" class="Machine" displayName="$(string.Printer_24_Machine_DisplayName)" explainText="$(string.Printer_24_Machine_ExplainText)" presentation="$(presentation.Printer_24_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="24">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_24_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\24" valueName="Path" required="true" />
        <enum id="Printer_24_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\24" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_24_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\24" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_25_Machine" class="Machine" displayName="$(string.Printer_25_Machine_DisplayName)" explainText="$(string.Printer_25_Machine_ExplainText)" presentation="$(presentation.Printer_25_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="25">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_25_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\25" valueName="Path" required="true" />
        <enum id="Printer_25_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\25" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_25_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\25" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_26_Machine" class="Machine" displayName="$(string.Printer_26_Machine_DisplayName)" explainText="$(string.Printer_26_Machine_ExplainText)" presentation="$(presentation.Printer_26_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="26">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_26_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\26" valueName="Path" required="true" />
        <enum id="Printer_26_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\26" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_26_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\26" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_27_Machine" class="Machine" displayName="$(string.Printer_27_Machine_DisplayName)" explainText="$(string.Printer_27_Machine_ExplainText)" presentation="$(presentation.Printer_27_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="27">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_27_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\27" valueName="Path" required="true" />
        <enum id="Printer_27_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\27" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_27_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\27" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_28_Machine" class="Machine" displayName="$(string.Printer_28_Machine_DisplayName)" explainText="$(string.Printer_28_Machine_ExplainText)" presentation="$(presentation.Printer_28_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="28">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_28_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\28" valueName="Path" required="true" />
        <enum id="Printer_28_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\28" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_28_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\28" valueName="SetDefault" />
      </elements>
    </policy>
<policy name="Printer_29_Machine" class="Machine" displayName="$(string.Printer_29_Machine_DisplayName)" explainText="$(string.Printer_29_Machine_ExplainText)" presentation="$(presentation.Printer_29_Machine_Presentation)" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies" valueName="29">
      <parentCategory ref="Printers" />
      <supportedOn ref="SupportedOn" />
      <elements>
        <text id="Printer_29_Machine_Path" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\29" valueName="Path" required="true" />
        <enum id="Printer_29_Machine_Operation" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\29" valueName="Operation" required="true">
            <item displayName="$(string.Add)">
                <value>
                    <string>Add</string>
                </value>
            </item>
            <item displayName="$(string.Delete)">
                <value>
                    <string>Delete</string>
                </value>
            </item>
        </enum>
        <boolean id="Printer_29_Machine_SetDefault" key="Software\Policies\weatherlights.com\NetworkPrintMapping\Policies\29" valueName="SetDefault" />
      </elements>
    </policy>



  </policies>
</policyDefinitions>
