<?xml version="1.0" encoding="UTF-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions" revision="1.0" schemaVersion="1.0">
  <displayName>Intune-Printer-Mapping</displayName>
  <description>Intune-Printer-Mapping</description>
  <resources>
    <stringTable>
      <string id="IntunePrinterMapping">Intune-Printer-Mapping</string>
      <string id="Configuration">Configuration</string>
      <string id="Printers">Printers</string>
      <string id="SupportedOn">Windows 10 and Windows 11</string>
      <string id="Enabled">Enable Intune Printer Mapping</string>
      <string id="Enabled_Help">This enables Intune Printer Mapping.

Configurations will only be applied when this configuration is set to Enabled.
</string>
      <string id="RefreshInterval">Refresh interval</string>
      <string id="RefreshInterval_Help">Sets the refresh interval in ms. Default is 10000.</string>

      <string id="UpdateInterval">Update interval</string>
      <string id="UpdateInterval_Help">Configures how often Intune Network Print Mapping will check for updates (in seconds). Default ist 10800.</string>
      
      <string id="PrinterConfigurationRefreshInterval">Printer configuration refresh interval</string>
      <string id="PrinterConfigurationRefreshInterval_Help">Configures how often Intune Print Mapping will reapply configured printer configurations (in seconds). Default ist 3600.</string>
    
    <string id="Add">Add</string>    
    <string id="Delete">Delete</string>   
    
<string id="Printer_0_User_DisplayName">Printer operation 0</string>
    <string id="Printer_0_User_ExplainText">Printer operation 0. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_1_User_DisplayName">Printer operation 1</string>
    <string id="Printer_1_User_ExplainText">Printer operation 1. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_2_User_DisplayName">Printer operation 2</string>
    <string id="Printer_2_User_ExplainText">Printer operation 2. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_3_User_DisplayName">Printer operation 3</string>
    <string id="Printer_3_User_ExplainText">Printer operation 3. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_4_User_DisplayName">Printer operation 4</string>
    <string id="Printer_4_User_ExplainText">Printer operation 4. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_5_User_DisplayName">Printer operation 5</string>
    <string id="Printer_5_User_ExplainText">Printer operation 5. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_6_User_DisplayName">Printer operation 6</string>
    <string id="Printer_6_User_ExplainText">Printer operation 6. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_7_User_DisplayName">Printer operation 7</string>
    <string id="Printer_7_User_ExplainText">Printer operation 7. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_8_User_DisplayName">Printer operation 8</string>
    <string id="Printer_8_User_ExplainText">Printer operation 8. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_9_User_DisplayName">Printer operation 9</string>
    <string id="Printer_9_User_ExplainText">Printer operation 9. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_10_User_DisplayName">Printer operation 10</string>
    <string id="Printer_10_User_ExplainText">Printer operation 10. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_11_User_DisplayName">Printer operation 11</string>
    <string id="Printer_11_User_ExplainText">Printer operation 11. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_12_User_DisplayName">Printer operation 12</string>
    <string id="Printer_12_User_ExplainText">Printer operation 12. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_13_User_DisplayName">Printer operation 13</string>
    <string id="Printer_13_User_ExplainText">Printer operation 13. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_14_User_DisplayName">Printer operation 14</string>
    <string id="Printer_14_User_ExplainText">Printer operation 14. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_15_User_DisplayName">Printer operation 15</string>
    <string id="Printer_15_User_ExplainText">Printer operation 15. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_16_User_DisplayName">Printer operation 16</string>
    <string id="Printer_16_User_ExplainText">Printer operation 16. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_17_User_DisplayName">Printer operation 17</string>
    <string id="Printer_17_User_ExplainText">Printer operation 17. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_18_User_DisplayName">Printer operation 18</string>
    <string id="Printer_18_User_ExplainText">Printer operation 18. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_19_User_DisplayName">Printer operation 19</string>
    <string id="Printer_19_User_ExplainText">Printer operation 19. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_20_User_DisplayName">Printer operation 20</string>
    <string id="Printer_20_User_ExplainText">Printer operation 20. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_21_User_DisplayName">Printer operation 21</string>
    <string id="Printer_21_User_ExplainText">Printer operation 21. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_22_User_DisplayName">Printer operation 22</string>
    <string id="Printer_22_User_ExplainText">Printer operation 22. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_23_User_DisplayName">Printer operation 23</string>
    <string id="Printer_23_User_ExplainText">Printer operation 23. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_24_User_DisplayName">Printer operation 24</string>
    <string id="Printer_24_User_ExplainText">Printer operation 24. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_25_User_DisplayName">Printer operation 25</string>
    <string id="Printer_25_User_ExplainText">Printer operation 25. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_26_User_DisplayName">Printer operation 26</string>
    <string id="Printer_26_User_ExplainText">Printer operation 26. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_27_User_DisplayName">Printer operation 27</string>
    <string id="Printer_27_User_ExplainText">Printer operation 27. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_28_User_DisplayName">Printer operation 28</string>
    <string id="Printer_28_User_ExplainText">Printer operation 28. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_29_User_DisplayName">Printer operation 29</string>
    <string id="Printer_29_User_ExplainText">Printer operation 29. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_0_Machine_DisplayName">Printer operation 0</string>
    <string id="Printer_0_Machine_ExplainText">Printer operation 0. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_1_Machine_DisplayName">Printer operation 1</string>
    <string id="Printer_1_Machine_ExplainText">Printer operation 1. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_2_Machine_DisplayName">Printer operation 2</string>
    <string id="Printer_2_Machine_ExplainText">Printer operation 2. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_3_Machine_DisplayName">Printer operation 3</string>
    <string id="Printer_3_Machine_ExplainText">Printer operation 3. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_4_Machine_DisplayName">Printer operation 4</string>
    <string id="Printer_4_Machine_ExplainText">Printer operation 4. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_5_Machine_DisplayName">Printer operation 5</string>
    <string id="Printer_5_Machine_ExplainText">Printer operation 5. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_6_Machine_DisplayName">Printer operation 6</string>
    <string id="Printer_6_Machine_ExplainText">Printer operation 6. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_7_Machine_DisplayName">Printer operation 7</string>
    <string id="Printer_7_Machine_ExplainText">Printer operation 7. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_8_Machine_DisplayName">Printer operation 8</string>
    <string id="Printer_8_Machine_ExplainText">Printer operation 8. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_9_Machine_DisplayName">Printer operation 9</string>
    <string id="Printer_9_Machine_ExplainText">Printer operation 9. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_10_Machine_DisplayName">Printer operation 10</string>
    <string id="Printer_10_Machine_ExplainText">Printer operation 10. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_11_Machine_DisplayName">Printer operation 11</string>
    <string id="Printer_11_Machine_ExplainText">Printer operation 11. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_12_Machine_DisplayName">Printer operation 12</string>
    <string id="Printer_12_Machine_ExplainText">Printer operation 12. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_13_Machine_DisplayName">Printer operation 13</string>
    <string id="Printer_13_Machine_ExplainText">Printer operation 13. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_14_Machine_DisplayName">Printer operation 14</string>
    <string id="Printer_14_Machine_ExplainText">Printer operation 14. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_15_Machine_DisplayName">Printer operation 15</string>
    <string id="Printer_15_Machine_ExplainText">Printer operation 15. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_16_Machine_DisplayName">Printer operation 16</string>
    <string id="Printer_16_Machine_ExplainText">Printer operation 16. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_17_Machine_DisplayName">Printer operation 17</string>
    <string id="Printer_17_Machine_ExplainText">Printer operation 17. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_18_Machine_DisplayName">Printer operation 18</string>
    <string id="Printer_18_Machine_ExplainText">Printer operation 18. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_19_Machine_DisplayName">Printer operation 19</string>
    <string id="Printer_19_Machine_ExplainText">Printer operation 19. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_20_Machine_DisplayName">Printer operation 20</string>
    <string id="Printer_20_Machine_ExplainText">Printer operation 20. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_21_Machine_DisplayName">Printer operation 21</string>
    <string id="Printer_21_Machine_ExplainText">Printer operation 21. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_22_Machine_DisplayName">Printer operation 22</string>
    <string id="Printer_22_Machine_ExplainText">Printer operation 22. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_23_Machine_DisplayName">Printer operation 23</string>
    <string id="Printer_23_Machine_ExplainText">Printer operation 23. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_24_Machine_DisplayName">Printer operation 24</string>
    <string id="Printer_24_Machine_ExplainText">Printer operation 24. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_25_Machine_DisplayName">Printer operation 25</string>
    <string id="Printer_25_Machine_ExplainText">Printer operation 25. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_26_Machine_DisplayName">Printer operation 26</string>
    <string id="Printer_26_Machine_ExplainText">Printer operation 26. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_27_Machine_DisplayName">Printer operation 27</string>
    <string id="Printer_27_Machine_ExplainText">Printer operation 27. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_28_Machine_DisplayName">Printer operation 28</string>
    <string id="Printer_28_Machine_ExplainText">Printer operation 28. Specify the printer path and the operation (Add or Remove).</string>


<string id="Printer_29_Machine_DisplayName">Printer operation 29</string>
    <string id="Printer_29_Machine_ExplainText">Printer operation 29. Specify the printer path and the operation (Add or Remove).</string>
    
    
    </stringTable>
    <presentationTable>
      <presentation id="RefreshInterval">
        <decimalTextBox  refId="RefreshInterval" defaultValue="10000">Refresh interval</decimalTextBox >
      </presentation>
      <presentation id="UpdateInterval">
        <decimalTextBox  refId="UpdateInterval" defaultValue="10800">Update interval</decimalTextBox >
      </presentation>
      <presentation id="PrinterConfigurationRefreshInterval">
        <decimalTextBox  refId="PrinterConfigurationRefreshInterval" defaultValue="3600">Printer configuration refresh interval</decimalTextBox >
      </presentation>

<presentation id="Printer_0_User_Presentation">
    <textBox refId="Printer_0_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_0_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_0_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_1_User_Presentation">
    <textBox refId="Printer_1_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_1_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_1_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_2_User_Presentation">
    <textBox refId="Printer_2_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_2_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_2_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_3_User_Presentation">
    <textBox refId="Printer_3_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_3_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_3_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_4_User_Presentation">
    <textBox refId="Printer_4_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_4_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_4_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_5_User_Presentation">
    <textBox refId="Printer_5_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_5_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_5_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_6_User_Presentation">
    <textBox refId="Printer_6_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_6_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_6_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_7_User_Presentation">
    <textBox refId="Printer_7_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_7_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_7_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_8_User_Presentation">
    <textBox refId="Printer_8_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_8_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_8_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_9_User_Presentation">
    <textBox refId="Printer_9_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_9_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_9_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_10_User_Presentation">
    <textBox refId="Printer_10_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_10_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_10_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_11_User_Presentation">
    <textBox refId="Printer_11_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_11_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_11_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_12_User_Presentation">
    <textBox refId="Printer_12_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_12_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_12_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_13_User_Presentation">
    <textBox refId="Printer_13_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_13_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_13_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_14_User_Presentation">
    <textBox refId="Printer_14_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_14_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_14_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_15_User_Presentation">
    <textBox refId="Printer_15_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_15_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_15_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_16_User_Presentation">
    <textBox refId="Printer_16_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_16_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_16_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_17_User_Presentation">
    <textBox refId="Printer_17_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_17_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_17_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_18_User_Presentation">
    <textBox refId="Printer_18_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_18_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_18_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_19_User_Presentation">
    <textBox refId="Printer_19_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_19_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_19_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_20_User_Presentation">
    <textBox refId="Printer_20_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_20_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_20_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_21_User_Presentation">
    <textBox refId="Printer_21_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_21_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_21_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_22_User_Presentation">
    <textBox refId="Printer_22_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_22_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_22_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_23_User_Presentation">
    <textBox refId="Printer_23_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_23_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_23_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_24_User_Presentation">
    <textBox refId="Printer_24_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_24_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_24_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_25_User_Presentation">
    <textBox refId="Printer_25_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_25_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_25_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_26_User_Presentation">
    <textBox refId="Printer_26_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_26_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_26_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_27_User_Presentation">
    <textBox refId="Printer_27_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_27_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_27_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_28_User_Presentation">
    <textBox refId="Printer_28_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_28_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_28_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_29_User_Presentation">
    <textBox refId="Printer_29_User_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_29_User_Operation">Operation</dropdownList>
    <checkBox refId="Printer_29_User_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_0_Machine_Presentation">
    <textBox refId="Printer_0_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_0_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_0_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_1_Machine_Presentation">
    <textBox refId="Printer_1_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_1_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_1_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_2_Machine_Presentation">
    <textBox refId="Printer_2_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_2_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_2_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_3_Machine_Presentation">
    <textBox refId="Printer_3_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_3_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_3_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_4_Machine_Presentation">
    <textBox refId="Printer_4_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_4_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_4_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_5_Machine_Presentation">
    <textBox refId="Printer_5_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_5_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_5_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_6_Machine_Presentation">
    <textBox refId="Printer_6_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_6_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_6_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_7_Machine_Presentation">
    <textBox refId="Printer_7_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_7_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_7_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_8_Machine_Presentation">
    <textBox refId="Printer_8_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_8_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_8_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_9_Machine_Presentation">
    <textBox refId="Printer_9_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_9_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_9_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_10_Machine_Presentation">
    <textBox refId="Printer_10_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_10_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_10_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_11_Machine_Presentation">
    <textBox refId="Printer_11_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_11_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_11_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_12_Machine_Presentation">
    <textBox refId="Printer_12_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_12_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_12_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_13_Machine_Presentation">
    <textBox refId="Printer_13_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_13_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_13_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_14_Machine_Presentation">
    <textBox refId="Printer_14_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_14_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_14_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_15_Machine_Presentation">
    <textBox refId="Printer_15_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_15_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_15_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_16_Machine_Presentation">
    <textBox refId="Printer_16_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_16_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_16_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_17_Machine_Presentation">
    <textBox refId="Printer_17_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_17_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_17_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_18_Machine_Presentation">
    <textBox refId="Printer_18_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_18_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_18_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_19_Machine_Presentation">
    <textBox refId="Printer_19_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_19_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_19_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_20_Machine_Presentation">
    <textBox refId="Printer_20_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_20_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_20_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_21_Machine_Presentation">
    <textBox refId="Printer_21_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_21_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_21_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_22_Machine_Presentation">
    <textBox refId="Printer_22_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_22_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_22_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_23_Machine_Presentation">
    <textBox refId="Printer_23_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_23_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_23_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_24_Machine_Presentation">
    <textBox refId="Printer_24_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_24_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_24_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_25_Machine_Presentation">
    <textBox refId="Printer_25_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_25_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_25_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_26_Machine_Presentation">
    <textBox refId="Printer_26_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_26_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_26_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_27_Machine_Presentation">
    <textBox refId="Printer_27_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_27_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_27_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_28_Machine_Presentation">
    <textBox refId="Printer_28_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_28_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_28_Machine_SetDefault">Set Default</checkBox>
</presentation>


<presentation id="Printer_29_Machine_Presentation">
    <textBox refId="Printer_29_Machine_Path"><label>Path</label><defaultValue></defaultValue></textBox>
    <dropdownList refId="Printer_29_Machine_Operation">Operation</dropdownList>
    <checkBox refId="Printer_29_Machine_SetDefault">Set Default</checkBox>
</presentation>

      
      
    </presentationTable>
  </resources>
</policyDefinitionResources>
